import pytest

from programmatic_nikud import hebrew_num_to_int, extract_number_phrases


@pytest.mark.parametrize("hebrew, expected", [
    ("שֶׁבַע שְׁנֵי", 7),
])
def test_hebrew_num_to_int(hebrew, expected):
    assert hebrew_num_to_int(hebrew) == expected


@pytest.mark.parametrize(
    "verse,expected",
    [
        # (
        #         "כִּי שִׁבְעָתַיִם, יֻקַּם-קָיִן; וְלֶמֶךְ, שִׁבְעִים וְשִׁבְעָה",
        #         ["שִׁבְעִים וְשִׁבְעָה"]
        # ),
        # (
        #         "וַיִּהְיוּ, כָּל-יְמֵי-שֵׁת, שְׁתֵּים עֶשְׂרֵה שָׁנָה, וּתְשַׁע מֵאוֹת שָׁנָה; וַיָּמֹת.",
        #         ["שְׁתֵּים עֶשְׂרֵה", "וּתְשַׁע מֵאוֹת"]
        # ),
        (
                "וַיְחִי חֲנוֹךְ חָמֵשׁ וְשִׁשִּׁים שָׁנָה וַיּוֹלֶד אֶתמְתוּשָׁלַח",
                ["חָמֵשׁ וְשִׁשִּׁים שָׁנָה"]
        ),
        (
                "וַיִּהְיוּ כָּליְמֵי מַהֲלַלְאֵל חָמֵשׁ וְתִשְׁעִים שָׁנָה וּשְׁמֹנֶה מֵאוֹת שָׁנָה וַיָּמֹת",
                ["חָמֵשׁ וְתִשְׁעִים שָׁנָה וּשְׁמֹנֶה מֵאוֹת שָׁנָה"]
        ),
        (
                "וַיְהִי כָּליְמֵי חֲנוֹךְ חָמֵשׁ וְשִׁשִּׁים שָׁנָה וּשְׁלֹשׁ מֵאוֹת שָׁנָה",
                ["חָמֵשׁ וְשִׁשִּׁים שָׁנָה וּשְׁלֹשׁ מֵאוֹת שָׁנָה"]
        ),
        (
                "וַיְחִי מְתוּשֶׁלַח שֶׁבַע וּשְׁמֹנִים שָׁנָה וּמְאַת שָׁנָה וַיּוֹלֶד אֶתלָמֶךְ",
                ["שֶׁבַע וּשְׁמֹנִים שָׁנָה וּמְאַת שָׁנָה"]
        ),
        (
                "וַיְחִי מְתוּשֶׁלַח אַחֲרֵי הוֹלִידוֹ אֶתלֶמֶךְ שְׁתַּיִם וּשְׁמוֹנִים שָׁנָה וּשְׁבַע מֵאוֹת שָׁנָה וַיּוֹלֶד בָּנִים וּבָנוֹת",
                ["שְׁתַּיִם וּשְׁמוֹנִים שָׁנָה וּשְׁבַע מֵאוֹת שָׁנָה"]
        ),
        (
            "וּלְיִשְׁמָעֵאל שְׁמַעְתִּיךָ הִנֵּה בֵּרַכְתִּי אֹתוֹ וְהִפְרֵיתִי אֹתוֹ וְהִרְבֵּיתִי אֹתוֹ בִּמְאֹד מְאֹד שְׁנֵים עָשָׂר נְשִׂיאִם יוֹלִיד וּנְתַתִּיו לְגוֹי גָּדוֹל",
            ["שְׁנֵים עָשָׂר"]
        ),
        (
                "אוּלַי יַחְסְרוּן חֲמִשִּׁים הַצַּדִּיקִם חֲמִשָּׁה הֲתַשְׁחִית בַּחֲמִשָּׁה אֶת כָּל הָעִיר וַיֹּאמֶר לֹא אַשְׁחִית אִם אֶמְצָא שָׁם אַרְבָּעִים וַחֲמִשָּׁה",
            ["חֲמִשִּׁים", "חֲמִשָּׁה", "בַּחֲמִשָּׁה", "אַרְבָּעִים וַחֲמִשָּׁה"]
        ),
        (
            "וַיִּהְיוּ חַיֵּי שָׂרָה מֵאָה שָׁנָה וְעֶשְׂרִים שָׁנָה וְשֶׁבַע שָׁנִים שְׁנֵי חַיֵּי שָׂרָה",
            ["מֵאָה שָׁנָה וְעֶשְׂרִים שָׁנָה וְשֶׁבַע שָׁנִים"]
        ),
        (
            "וַיְבָרְכוּ אֶת רִבְקָה וַיֹּאמְרוּ לָהּ אֲחֹתֵנוּ אַתְּ הֲיִי לְאַלְפֵי רְבָבָה וְיִירַשׁ זַרְעֵךְ אֵת שַׁעַר שֹׂנְאָיו",
            ["לְאַלְפֵי רְבָבָה"]
        ),
        (
            "וַיִּקְרָא אֹתָהּ שִׁבְעָה עַל כֵּן שֵׁם הָעִיר בְּאֵר שֶׁבַע עַד הַיּוֹם הַזֶּה",
            ["שִׁבְעָה"]
        ),
        (
            "וְקָמוּ שֶׁבַע שְׁנֵי רָעָב אַחֲרֵיהֶן וְנִשְׁכַּח כָּל הַשָּׂבָע בְּאֶרֶץ מִצְרָיִם וְכִלָּה הָרָעָב אֶת הָאָרֶץ",
            ["שֶׁבַע שְׁנֵי"]
        )

    ]
)
def test_extract_number_phrases(verse, expected):
    result = extract_number_phrases(verse)
    assert result == expected
