import pytest

from bible_types import Time
from programmatic_nikud import hebrew_num_to_int, extract_number_phrases, preprocess_token


def test_preprocess_token():
    s = 'וּשְׁלֹשִׁים'
    assert preprocess_token(s)[0] == 'שְׁלֹשִׁים'

    s = 'בִּשְׁלוֹשָׁה'
    assert preprocess_token(s)[0] == 'שְׁלוֹשָׁה'


@pytest.mark.parametrize("hebrew, expected", [
    ("שֶׁבַע שְׁנֵי", Time(7)),
    ("אַרְבַּע מֵאוֹת אֶלֶף", 400000),
    ("שְׁנַיִם וּשְׁלֹשִׁים אֶלֶף וַחֲמֵשׁ מֵאוֹת", 32500),
    ("אַרְבָּעָה אֶלֶף וְתִשְׁעִים", 4090),
    ("מֵאָה וּשְׁמוֹנָה", 108),
    ("שְׁלוֹשִׁים וּשָׁלוֹשׁ", 33),
    ("אַרְבָּעָה וַחֲמִשִּׁים", 54),
    ("אֶלֶף וּמֵאָה", 1100),

    ("שְׁנֵים עָשָׂר", 12),
    ("מִשֶׁבַע שָׁנִים", Time(7)),
    ("לְשֶׁבַע שָׁנִים", Time(7)),
    ("שְׁתֵּים עֶשְׂרֵה", 12),
    ("לִשְׁנֵי עָשָׂר", 12),
    ("שֵׁשׁ מֵאוֹת אֶלֶף וּשְׁלֹשֶׁת אֲלָפִים וַחֲמֵשׁ מֵאוֹת וַחֲמִשִּׁים", 603550),
    ("אַרְבָּעִים שָׁנָה וּשְׁמוֹנֶה מֵאוֹת שָׁנָה", Time(840)),
    ("שְׁלֹשׁ מֵאוֹת", 300),
    ("שֶׁבַע וּמָאתַיִם", 207),
    ("שֶׁבַע וּמֵאָה", 107),
    ("מְאַת שָׁנָה וּשְׁלֹשִׁים שָׁנָה וְשֶׁבַע שָׁנִים", Time(137)),
    ("שְׁלֹשִׁים וּמֵאָה", 130),
    ("שֶׁבַע וְאַרְבָּעִים וּמֵאָה", 147),
    ("אַרְבָּעָה עָשָׂר", 14),
    ("אֶלֶף וּשְׁבַע מֵאוֹת וַחֲמִשָּׁה וְשִׁבְעִים", 1775),
    ("שֶׁבַע וּשְׁלֹשִׁים וּמְאַת שָׁנָה", Time(137)),
    ("מֵאָה אֶלֶף וּשְׁמוֹנִים אֶלֶף וּשֵׁשֶׁת אֲלָפִים וְאַרְבַּע מֵאוֹת", 186400),
    ("מֵאָה אֶלֶף וּשְׁמוֹנִים אֶלֶף וּשֵׁשֶׁת אֲלָפִים וְאַרְבַּע מֵאוֹת וּשְׁלֹשׁ", 186403),
    ("מֵאָה אֶלֶף וּשְׁמוֹנִים אֶלֶף וּשֵׁשֶׁת אֲלָפִים וְאַרְבַּע מֵאוֹת וּשְׁלוֹשִׁים וְחָמֵשׁ", 186435),
    ("אֶלֶף אֲלָפִים", 1000000),
    ("שְׁמוֹנַת אֲלָפִים", 8000),
    ("רִבּוֹא וּשְׁמוֹנַת אֲלָפִים", 18000),
    ("שְׁתֵּים עֶשְׂרֵה שָׁנָה וּתְשַׁע מֵאוֹת שָׁנָה", Time(912)),
])
def test_hebrew_num_to_int(hebrew, expected):
    print()
    print(hebrew)
    print(expected)
    assert hebrew_num_to_int(hebrew) == expected


@pytest.mark.parametrize(
    "verse,expected",
    [
        # (
        #     "כִּי יִמָּכֵר לְךָ אָחִיךָ הָעִבְרִי אוֹ הָעִבְרִיָּה וַעֲבָדְךָ שֵׁשׁ שָׁנִים וּבַשָּׁנָה הַשְּׁבִיעִת תְּשַׁלְּחֶנּוּ חָפְשִׁי מֵעִמָּךְ",
        #     [("שֵׁשׁ שָׁנִים", Time(6)), ("וּבַשָּׁנָה הַשְּׁבִיעִת", Time(7, is_date=True))]
        # ),
        # (
        #     "וַיְהִי מִקֵּץ אַרְבָּעִים יוֹם וְאַרְבָּעִים לָיְלָה נָתַן יְהוָה אֵלַי אֶת שְׁנֵי לֻחֹת הָאֲבָנִים לֻחוֹת הַבְּרִית",
        #     [("אַרְבָּעִים יוֹם וְאַרְבָּעִים לָיְלָה", Time(days=40)), ("שְׁנֵי", 2)]
        # ),
        # (
        #     "וְכֵן תַּעֲשֶׂה בְּשִׁבְעָה בַחֹדֶשׁ מֵאִישׁ שֹׁגֶה וּמִפֶּתִי וְכִפַּרְתֶּם אֶת הַבָּיִת",
        #     [("בְּשִׁבְעָה בַחֹדֶשׁ", Time(days=7, is_date=True))]
        # ),
        # (
        #     "בִּשְׁנַת שְׁמוֹנֶה עֶשְׂרֵה לִנְבוּכַדְרֶאצַּר מִירוּשָׁלִַם נֶפֶשׁ שְׁמֹנֶה מֵאוֹת שְׁלֹשִׁים וּשְׁנָיִם",
        #     [("בִּשְׁנַת שְׁמוֹנֶה עֶשְׂרֵה", Time(18, is_date=True)), ("שְׁמֹנֶה מֵאוֹת שְׁלֹשִׁים וּשְׁנָיִם", 832)]
        # ),
        (
            "וּבַשָּׁנָה הָאַחַת עֶשְׂרֵה בְּיֶרַח בּוּל הוּא הַחֹדֶשׁ הַשְּׁמִינִי כָּלָה הַבַּיִת לְכָל דְּבָרָיו וּלְכָל מִשְׁפָּטָו וַיִּבְנֵהוּ שֶׁבַע שָׁנִים",
            [('וּבַשָּׁנָה הָאַחַת עֶשְׂרֵה', Time(11, is_date=True)), ('הַחֹדֶשׁ הַשְּׁמִינִי', Time(months=8, is_date=True)), ('שֶׁבַע שָׁנִים', Time(years=7, is_date=False))]
        ),
        (
            "שַׁלּוּם בֶּן יָבֵישׁ מָלַךְ בִּשְׁנַת שְׁלֹשִׁים וָתֵשַׁע שָׁנָה לְעֻזִּיָּה מֶלֶךְ יְהוּדָה וַיִּמְלֹךְ יֶרַח יָמִים בְּשֹׁמְרוֹן",
            [("בִּשְׁנַת שְׁלֹשִׁים וָתֵשַׁע שָׁנָה", Time(39, is_date=True))]
        ),
        (
            "וְחֻמְטָה וְקִרְיַת אַרְבַּע הִיא חֶבְרוֹן וְצִיעֹר עָרִים תֵּשַׁע וְחַצְרֵיהֶן",
            [("תֵּשַׁע", 9)]
        ),
        (
            "וַיִּשְׁלַח דָּוִד וַיִּדְרֹשׁ לָאִשָּׁה וַיֹּאמֶר הֲלוֹא זֹאת בַּת שֶׁבַע בַּת אֱלִיעָם אֵשֶׁת אוּרִיָּה הַחִתִּי",
            []
        ),
        (
            "בֶּקַע לַגֻּלְגֹּלֶת מַחֲצִית הַשֶּׁקֶל בְּשֶׁקֶל הַקֹּדֶשׁ לְכֹל הָעֹבֵר עַל הַפְּקֻדִים מִבֶּן עֶשְׂרִים שָׁנָה וָמַעְלָה לְשֵׁשׁ מֵאוֹת אֶלֶף וּשְׁלֹשֶׁת אֲלָפִים וַחֲמֵשׁ מֵאוֹת וַחֲמִשִּׁים",
            [("עֶשְׂרִים שָׁנָה", Time(20)), ("לְשֵׁשׁ מֵאוֹת אֶלֶף וּשְׁלֹשֶׁת אֲלָפִים וַחֲמֵשׁ מֵאוֹת וַחֲמִשִּׁים", 603550)]
        ),
        (
            "וַיְהִי בְּאַחַת וְשֵׁשׁ מֵאוֹת שָׁנָה בָּרִאשׁוֹן בְּאֶחָד לַחֹדֶשׁ חָרְבוּ הַמַּיִם מֵעַל הָאָרֶץ וַיָּסַר נֹחַ אֶת מִכְסֵה הַתֵּבָה וַיַּרְא וְהִנֵּה חָרְבוּ פְּנֵי הָאֲדָמָה",
            [("בְּאַחַת וְשֵׁשׁ מֵאוֹת שָׁנָה", Time(601)),  ('בָּרִאשׁוֹן', 1), ("בְּאֶחָד לַחֹדֶשׁ", Time(days=1, is_date=True))]
        ),
        (
            "אֹרֶךְ הָאֻלָם עֶשְׂרִים אַמָּה וְרֹחַב עַשְׁתֵּי עֶשְׂרֵה אַמָּה וּבַמַּעֲלוֹת אֲשֶׁר יַעֲלוּ אֵלָיו וְעַמֻּדִים אֶל הָאֵילִים אֶחָד מִפֹּה וְאֶחָד מִפֹּה",
            [("עֶשְׂרִים", 20), ("עַשְׁתֵּי עֶשְׂרֵה", 11), ('אֶחָד', 1), ('וְאֶחָד', 1)]
        ),
        (
            "וּבַחֹדֶשׁ הָרִאשׁוֹן בְּאַרְבָּעָה עָשָׂר יוֹם לַחֹדֶשׁ פֶּסַח לַיהוָה",
            [("וּבַחֹדֶשׁ הָרִאשׁוֹן", Time(months=1, is_date=True)), ("בְּאַרְבָּעָה עָשָׂר יוֹם לַחֹדֶשׁ", Time(days=14, is_date=True))]
        ),
        (
            "כָּל הַפְּקֻדִים לְמַחֲנֵה רְאוּבֵן מְאַת אֶלֶף וְאֶחָד וַחֲמִשִּׁים אֶלֶף וְאַרְבַּע מֵאוֹת וַחֲמִשִּׁים לְצִבְאֹתָם וּשְׁנִיִּם יִסָּעוּ",
            [("מְאַת אֶלֶף וְאֶחָד וַחֲמִשִּׁים אֶלֶף וְאַרְבַּע מֵאוֹת וַחֲמִשִּׁים", 151450)]
        ),
        (
            "כִּי אֶלֶף שָׁנִים בְּעֵינֶיךָ כְּיוֹם אֶתְמוֹל כִּי יַעֲבֹר",
            [("אֶלֶף שָׁנִים", Time(1000))],
        ),
        (
            "וְסָפַרְתָּ לְךָ שֶׁבַע שַׁבְּתֹת שָׁנִים שֶׁבַע שָׁנִים שֶׁבַע פְּעָמִים וְהָיוּ לְךָ יְמֵי שֶׁבַע שַׁבְּתֹת הַשָּׁנִים תֵּשַׁע וְאַרְבָּעִים שָׁנָה",
            [("שֶׁבַע", 7), ("שֶׁבַע שָׁנִים", Time(7)), ("שֶׁבַע", 7), ("שֶׁבַע", 7), ("תֵּשַׁע וְאַרְבָּעִים שָׁנָה", Time(49)), ]
        ),
        (
            "וַיְהִי שָׁם עִם יְהוָה אַרְבָּעִים יוֹם וְאַרְבָּעִים לַיְלָה לֶחֶם לֹא אָכַל וּמַיִם לֹא שָׁתָה וַיִּכְתֹּב עַל הַלֻּחֹת אֵת דִּבְרֵי הַבְּרִית עֲשֶׂרֶת הַדְּבָרִים",
            [("אַרְבָּעִים יוֹם וְאַרְבָּעִים לַיְלָה", Time(days=40)), ("עֲשֶׂרֶת", 10)]
        ),
        (
            "בְּנֵי פַרְעֹשׁ אַלְפַּיִם מֵאָה וְשִׁבְעִים וּשְׁנָיִם",
            [("אַלְפַּיִם מֵאָה וְשִׁבְעִים וּשְׁנָיִם", 2172)]
        ),
        (
            "בֶּן שְׁמוֹנֶה שָׁנִים יְהוֹיָכִין בְּמָלְכוֹ וּשְׁלֹשָׁה חֳדָשִׁים וַעֲשֶׂרֶת יָמִים מָלַךְ בִּירוּשָׁלִָם וַיַּעַשׂ הָרַע בְּעֵינֵי יְהוָה",
            [("שְׁמוֹנֶה שָׁנִים", Time(8)), ("וּשְׁלֹשָׁה חֳדָשִׁים וַעֲשֶׂרֶת יָמִים", Time(months=3, days=10))]
        ),
        (
            "וְאֶל הַחֲצֵרִים בִּשְׂדֹתָם מִבְּנֵי יְהוּדָה יָשְׁבוּ בְּקִרְיַת הָאַרְבַּע וּבְנֹתֶיהָ וּבְדִיבֹן וּבְנֹתֶיהָ וּבִיקַּבְצְאֵל וַחֲצֵרֶיהָ",
            []
        ),
        (
            "וּבַחֲצַר שׁוּעָל וּבִבְאֵר שֶׁבַע וּבְנֹתֶיהָ",
            []
        ),
        (
            "וַיֹּאמֶר יַעֲקֹב אֶל פַּרְעֹה יְמֵי שְׁנֵי מְגוּרַי שְׁלֹשִׁים וּמְאַת שָׁנָה מְעַט וְרָעִים הָיוּ יְמֵי שְׁנֵי חַיַּי וְלֹא הִשִּׂיגוּ אֶת יְמֵי שְׁנֵי חַיֵּי אֲבֹתַי בִּימֵי מְגוּרֵיהֶם",
            [("שְׁלֹשִׁים וּמְאַת שָׁנָה", Time(130))]
        ),
        (
            "כִּי שִׁבְעָתַיִם, יֻקַּם-קָיִן; וְלֶמֶךְ, שִׁבְעִים וְשִׁבְעָה",
            [("שִׁבְעִים וְשִׁבְעָה", 77)]
        ),
        (
            "וַיִּהְיוּ כָּל-יְמֵי-שֵׁת שְׁתֵּים עֶשְׂרֵה שָׁנָה וּתְשַׁע מֵאוֹת שָׁנָה וַיָּמֹת.",
            [("שְׁתֵּים עֶשְׂרֵה שָׁנָה וּתְשַׁע מֵאוֹת שָׁנָה", Time(912))]
        ),
        (
            "וַיְחִי חֲנוֹךְ חָמֵשׁ וְשִׁשִּׁים שָׁנָה וַיּוֹלֶד אֶתמְתוּשָׁלַח",
            [("חָמֵשׁ וְשִׁשִּׁים שָׁנָה", Time(65))]
        ),
        (
            "וַיִּהְיוּ כָּליְמֵי מַהֲלַלְאֵל חָמֵשׁ וְתִשְׁעִים שָׁנָה וּשְׁמֹנֶה מֵאוֹת שָׁנָה וַיָּמֹת",
            [("חָמֵשׁ וְתִשְׁעִים שָׁנָה וּשְׁמֹנֶה מֵאוֹת שָׁנָה", Time(895))]
        ),
        (
            "וַיְהִי כָּליְמֵי חֲנוֹךְ חָמֵשׁ וְשִׁשִּׁים שָׁנָה וּשְׁלֹשׁ מֵאוֹת שָׁנָה",
            [("חָמֵשׁ וְשִׁשִּׁים שָׁנָה וּשְׁלֹשׁ מֵאוֹת שָׁנָה", Time(365))]
        ),
        (
            "וַיְחִי מְתוּשֶׁלַח שֶׁבַע וּשְׁמֹנִים שָׁנָה וּמְאַת שָׁנָה וַיּוֹלֶד אֶתלָמֶךְ",
            [("שֶׁבַע וּשְׁמֹנִים שָׁנָה וּמְאַת שָׁנָה", Time(187))]
        ),
        (
            "וַיְחִי מְתוּשֶׁלַח אַחֲרֵי הוֹלִידוֹ אֶתלֶמֶךְ שְׁתַּיִם וּשְׁמוֹנִים שָׁנָה וּשְׁבַע מֵאוֹת שָׁנָה וַיּוֹלֶד בָּנִים וּבָנוֹת",
            [("שְׁתַּיִם וּשְׁמוֹנִים שָׁנָה וּשְׁבַע מֵאוֹת שָׁנָה", Time(782))]
        ),
        (
            "וּלְיִשְׁמָעֵאל שְׁמַעְתִּיךָ הִנֵּה בֵּרַכְתִּי אֹתוֹ וְהִפְרֵיתִי אֹתוֹ וְהִרְבֵּיתִי אֹתוֹ בִּמְאֹד מְאֹד שְׁנֵים עָשָׂר נְשִׂיאִם יוֹלִיד וּנְתַתִּיו לְגוֹי גָּדוֹל",
            [("שְׁנֵים עָשָׂר", 12)]
        ),
        (
            "אוּלַי יַחְסְרוּן חֲמִשִּׁים הַצַּדִּיקִם חֲמִשָּׁה הֲתַשְׁחִית בַּחֲמִשָּׁה אֶת כָּל הָעִיר וַיֹּאמֶר לֹא אַשְׁחִית אִם אֶמְצָא שָׁם אַרְבָּעִים וַחֲמִשָּׁה",
            [("חֲמִשִּׁים", 50), ("חֲמִשָּׁה", 5), ("בַּחֲמִשָּׁה", 5), ("אַרְבָּעִים וַחֲמִשָּׁה", 45)]
        ),
        (
            "וַיִּהְיוּ חַיֵּי שָׂרָה מֵאָה שָׁנָה וְעֶשְׂרִים שָׁנָה וְשֶׁבַע שָׁנִים שְׁנֵי חַיֵּי שָׂרָה",
            [("מֵאָה שָׁנָה וְעֶשְׂרִים שָׁנָה וְשֶׁבַע שָׁנִים", Time(127))]
        ),
        (
            "וַיְבָרְכוּ אֶת רִבְקָה וַיֹּאמְרוּ לָהּ אֲחֹתֵנוּ אַתְּ הֲיִי לְאַלְפֵי רְבָבָה וְיִירַשׁ זַרְעֵךְ אֵת שַׁעַר שֹׂנְאָיו",
            [("לְאַלְפֵי רְבָבָה", 10000000)]
        ),
        (
            "וַיִּקְרָא אֹתָהּ שִׁבְעָה עַל כֵּן שֵׁם הָעִיר בְּאֵר שֶׁבַע עַד הַיּוֹם הַזֶּה",
            [("שִׁבְעָה", 7)]
        ),
        (
            "וְקָמוּ שֶׁבַע שְׁנֵי רָעָב אַחֲרֵיהֶן וְנִשְׁכַּח כָּל הַשָּׂבָע בְּאֶרֶץ מִצְרָיִם וְכִלָּה הָרָעָב אֶת הָאָרֶץ",
            [("שֶׁבַע שְׁנֵי", Time(7))]
        ),
        (
            "וַיֹּאמֶר רְאוּבֵן אֶל אָבִיו לֵאמֹר אֶת שְׁנֵי בָנַי תָּמִית אִם לֹא אֲבִיאֶנּוּ אֵלֶיךָ תְּנָה אֹתוֹ עַל יָדִי וַאֲנִי אֲשִׁיבֶנּוּ אֵלֶיךָ",
            [("שְׁנֵי", 2)]
        ),
        (
            "כַּף אַחַת עֲשָׂרָה זָהָב מְלֵאָה קְטֹרֶת",
            [('אַחַת', 1), ('עֲשָׂרָה', 10)]
        ),
        (
            "וּבִשְׁנַת אַחַת עֶשְׂרֵה שָׁנָה לְיוֹרָם בֶּן אַחְאָב מָלַךְ אֲחַזְיָה עַל יְהוּדָה",
            [("אַחַת עֶשְׂרֵה שָׁנָה", Time(11))]
        ),
        (
            "אֵלֶּה מִשְׁפְּחֹת בְּנֵי אֶפְרַיִם לִפְקֻדֵיהֶם שְׁנַיִם וּשְׁלֹשִׁים אֶלֶף וַחֲמֵשׁ מֵאוֹת אֵלֶּה בְנֵי יוֹסֵף לְמִשְׁפְּחֹתָם",
            [("שְׁנַיִם וּשְׁלֹשִׁים אֶלֶף וַחֲמֵשׁ מֵאוֹת", 32500)]
        ),
        (
            "אֵלֶּה מִשְׁפְּחֹת בְּנֵי אָשֵׁר לִפְקֻדֵיהֶם שְׁלֹשָׁה וַחֲמִשִּׁים אֶלֶף וְאַרְבַּע מֵאוֹת",
            [("שְׁלֹשָׁה וַחֲמִשִּׁים אֶלֶף וְאַרְבַּע מֵאוֹת", 53400)]
        ),
        (
            "זֶה לִּי עֶשְׂרִים שָׁנָה בְּבֵיתֶךָ עֲבַדְתִּיךָ אַרְבַּע עֶשְׂרֵה שָׁנָה בִּשְׁתֵּי בְנֹתֶיךָ וְשֵׁשׁ שָׁנִים בְּצֹאנֶךָ וַתַּחֲלֵף אֶת מַשְׂכֻּרְתִּי עֲשֶׂרֶת מֹנִים",
            [("עֶשְׂרִים שָׁנָה", Time(20)), ("אַרְבַּע עֶשְׂרֵה שָׁנָה", Time(14)), ("בִּשְׁתֵּי", 2), ("וְשֵׁשׁ שָׁנִים", Time(6)), ("עֲשֶׂרֶת", 10)]
        ),
        (
            "בְּחֶבְרוֹן מָלַךְ עַל יְהוּדָה שֶׁבַע שָׁנִים וְשִׁשָּׁה חֳדָשִׁים וּבִירוּשָׁלִַם מָלַךְ שְׁלֹשִׁים וְשָׁלֹשׁ שָׁנָה עַל כָּל יִשְׂרָאֵל וִיהוּדָה",
            [("שֶׁבַע שָׁנִים וְשִׁשָּׁה חֳדָשִׁים", Time(7, 6)), ("שְׁלֹשִׁים וְשָׁלֹשׁ שָׁנָה", Time(33))]
        ),
        (
            "עַל הַמַּחֲלֹקֶת הָרִאשׁוֹנָה לַחֹדֶשׁ הָרִאשׁוֹן יָשָׁבְעָם בֶּן זַבְדִּיאֵל וְעַל מַחֲלֻקְתּוֹ עֶשְׂרִים וְאַרְבָּעָה אָלֶף",
            [('הָרִאשׁוֹנָה', 1), ('לַחֹדֶשׁ הָרִאשׁוֹן', Time(months=1, is_date=True)), ('עֶשְׂרִים וְאַרְבָּעָה אָלֶף', 24000)]
        ),
        (
            "כָּל הַקָּהָל כְּאֶחָד אַרְבַּע רִבּוֹא אַלְפַּיִם שְׁלֹשׁ מֵאוֹת שִׁשִּׁים",
            [('כְּאֶחָד', 1), ('אַרְבַּע רִבּוֹא אַלְפַּיִם שְׁלֹשׁ מֵאוֹת שִׁשִּׁים', 42360)]
        ),
        (
            "וְרָדְפוּ מִכֶּם חֲמִשָּׁה מֵאָה וּמֵאָה מִכֶּם רְבָבָה יִרְדֹּפוּ וְנָפְלוּ אֹיְבֵיכֶם לִפְנֵיכֶם לֶחָרֶב",
            [("חֲמִשָּׁה", 5), ("מֵאָה", 100), ("וּמֵאָה", 100), ("רְבָבָה", 10000)]
        ),
        (
            "וַיֹּאמֶר לֵכִי וַיִּשְׁלַח אוֹתָהּ שְׁנֵי חֳדָשִׁים וַתֵּלֶךְ הִיא וְרֵעוֹתֶיהָ וַתֵּבְךְּ עַל בְּתוּלֶיהָ עַל הֶהָרִים",
            [("שְׁנֵי חֳדָשִׁים", Time(months=2))]
        ),
    ]
)
def test_extract_number_phrases(verse, expected):
    print()
    print(verse)
    print(expected)
    phrases = extract_number_phrases(verse)
    phrases_and_numbers = [(phrase, hebrew_num_to_int(phrase)) for phrase in phrases]
    print(phrases_and_numbers)
    assert phrases_and_numbers == expected
